SimuXAI/blog1/reactingParcelFoam_tutorial/constant/foam.inp
species
(
    O2
    H2O
    N2
)
;

reactions
{}
