SimuXAI/blog1/reactingParcelFoam_tutorial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    sides
    {
        type            patch;
        nFaces          1400;
        startFace       11200;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       12600;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
200
(
(4.33680869e-19 4.33680869e-19 -0)
(-8.67361738e-19 -8.67361738e-19 -0)
(-4.33680869e-19 -0 -0)
(-0 3.469446952e-18 -0)
(-0 -0 -0)
(-0 -0 -0)
(-0 -0 -0)
(4.33680869e-19 -0 -0)
...
)
;
    }
)

// ************************************************************************* //
