SimuXAI/blog1/reactingParcelFoam_tutorial/constant/wallFilmRegion/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/wallFilmRegion/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    wallFilmFaces_top
    {
        type            patch;
        nFaces          200;
        startFace       370;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            mappedWall;
        inGroups        List<word> 
2
(
wall
mappedPatch
)
;
        nFaces          200;
        startFace       570;
        sampleMode      nearestPatchFace;
        sampleRegion    region0;
        samplePatch     region0_to_wallFilmRegion_wallFilmFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
200
(
(-4.33680869e-19 -4.33680869e-19 0)
(8.67361738e-19 8.67361738e-19 0)
(4.33680869e-19 0 0)
(0 -3.469446952e-18 0)
(0 0 0)
(0 0 0)
(0 0 0)
(-4.33680869e-19 0 0)
...
)
;
    }
    side1
    {
        type            patch;
        nFaces          20;
        startFace       770;
    }
    side2
    {
        type            patch;
        nFaces          10;
        startFace       790;
    }
    side3
    {
        type            patch;
        nFaces          20;
        startFace       800;
    }
    side4
    {
        type            patch;
        nFaces          10;
        startFace       820;
    }
)

// ************************************************************************* //
